# Titanic数据 - 可视化

![](images/7.jpg)

### 导入数据

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [22]:
titanic = pd.read_csv('data/Titanic.csv')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### 统计年龄大于20的人数

In [16]:
(titanic['Age'] > 20).sum()

535

### 将PassengerId设置为索引

In [26]:
titanic.set_index('PassengerId')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### 绘制一个展示男女乘客比例的扇形图

In [62]:
male = (titanic['Sex'] == 'male').sum()
female = (titanic['Sex'] == 'female').sum()
proportions = [male, female]
plt.pie(proportions, labels=['Male', 'Female'], shadow=False, colors=['green', 'red'], explode=[0.02, 0], startangle=90, autopct='%1.1f%%')
plt.axis('equal')
plt.title('Sex proportions')
plt.tight_layout()
plt.show()

### 绘制一个展示船票Fare, 与乘客年龄和性别的散点图

In [63]:
lm = sns.lmplot(x = 'Age', y = 'Fare', data = titanic, hue = 'Sex', fit_reg=False)
lm.set(title = 'Fare x Age')

axes = lm.axes
axes[0, 0].set_ylim(-5, )
axes[0, 0].set_xlim(-5, 85)
plt.show()

### 有多少人生还？

In [64]:
titanic.Survived.sum()

342

### 绘制一个展示船票价格的直方图

In [65]:
df = titanic.Fare.sort_values(ascending=False)
binsVal = np.arange(0, 600, 10)
plt.hist(df, bins=binsVal)
plt.xlabel('Fare')
plt.ylabel('Frequency')
plt.title('Fare Payed Histrogram')
plt.show()